import pandas as pd
import re
import os

 offensive_words =  [ "אהצבועה", "אובססיבית", "איכס", "אינעל","שמוק","דביל","בולבול","קפוץ לי", "אנטיפתי", "אסתור", "בביצים", "בגועליציה", "בגזענותו", 
    "בוזין", "בזוי", "בזויים", "בחרא", "ביריונים", "בנזונה", "בקקה", "בשמוק", "בתחת", "בתחתונים", "גונב", "גונבי", 
    "גנב", "גנבים", "גנבת", "דימגוג", "דפוק", "דפוקים", "דרקים", "הארכיטיפ", "הבוגדים", "הזבל", "הזבלל", "הזדוניים", 
    "הזוי", "הזויה", "הזויים", "החאפרים", "החארות", "החולנית", "החולרה", "החוצפן", "החמור", "יחמור", "החפרן", 
    "היללן", "המבהיל", "המבחילה", "המושרצים", "המזורגג", "המחורבן", "המחורבנות", "המחורבנים", "המחורבנת", "המטומטם", 
    "המטומטמת", "המנוולת", "המניאקים", "המנייאק", "המסריח", "המסריחים", "המפלצת", "המתוסבכתנכדתו", "הסטן", 
    "הסרחוני", "הפאקינג", "הפושע", "הפושעים", "הפראייר", "הציבוז'י", "הקקה", "הרשע", "הרשעים", "הרשעית", "השמוק", 
    "השמוקים", "השקרן", "השקרנית", "השרלטנות", "התחת", "וגנב", "ודרעק", "והנבער", "והנצלנית", "והשפל", "וחלאות", 
    "וחרא", "וכוסאמק", "ולברבר", "ולעלובי", "ומנוול", "ומנוולים", "ומסריח", "וסורר", "וסטנים", "וסמרטוטית", 
    "וערמומית", "ופחדן", "ופטפטני", "ופסיכופטים", "וצבוע", "וצבועה", "וציפורע", "וקשקשן","קשקשן" "ורמאי", "ורמאים", 
    "ושקרן", "ושקרנים", "ושקרנית", "זבל", "זבלה", "זבלים", "זומבים", "חאלס", "חאפר", "חאפרים", "חאפרית", 
    "חובבן", "חולני", "חזיר", "חירבנה", "חמוריםםם", "חרא", "חראא", "חראאא", "טינופת", "טמטום", "יאוכלי", "יבן", 
    "יוק", "יזבל", "יזבלה", "יזבל", "יחתיכת", "יטמבל", "יליצן", "ימגעיל", "ימיץ", "ימניאק", "ימניייק", "ימנייק", 
    "ימניק", "ימעפן", "ינעל", "כאןצבועה", "ככלבלב", "יכלב", "כנפיחה", "כפודל", "כשחלאה", "לאזעזל", "להזויים", 
    "להשתין", "לזרגג", "לחאפר", "לחרא", "לחרבן", "גזען", "למותי", "לעזאזאל", "לעזזאל", "לקק", "לשקרנים", 
    "מאוסה", "מאפן", "מבהיל", "מבהילה", "מבהילים", "מבחילה", "מגעיל", "מגעילה", "מגעילים", "מהאדיוט", "מזוויעה", 
    "מזוויעים", "מזורגג", "מזנים", "מחורבן", "מחורבנות", "מחורבנת", "מטונף", "מלהתקרצץ", "מלשין", "מלשינה", 
    "ממזרים", "מנובל", "מנובלים", "מניאק", "מנייאק", "מנייק", "מניפולטורית", "מניפולטיבית", "מניק", "מנניאיק", 
    "מסקן", "מסקנים", "מסריח", "מסריחה", "מסריחות", "מסריחים", "מעפן", "מעפנהה", "מפגר", "מפגרים", "מפגרת", 
    "מפחידה", "משקר", "משקרים", "משתין", "משתינה", "משתינות", "משתינים", "נבזי", "נבזים", "נוכל", "נוכלות", 
    "נוכלים", "נוכלת", "נחש", "ניבזה", "נצלנים", "סאדיסטי", "סטן", "סטנים", "סטרפלצט", "סמרטוט", "עוכר", 
    "עוכרי", "עוכרת", "פָּתט", "פאקינג", "פברק", "פברקו", "פושע", "פושעת", "יפח", "פחדנים", "פחזבל", "פיפי", 
    "פלוץ", "פתטי", "פתי", "צבוע", "צבועה", "צבועים", "קברן", "קברניות", "קברנים", "קברנית", "קיבינמט", 
    "קקאיות", "קקה", "קקות", "קקי", "קרימינל", "קרימינלית", "רבאק", "רמאי", "רמאים", "רמאית", "רשלן", 
    "שאובססיבית", "שהמפלצת", "שודד", "שונא", "שונאת", "שטחית", "שלוזרים", "שמוק", "שמלאני", "שמלאנים", 
    "שמלנים", "שפיצרקה", "שקלוזה", "שקרן", "שקרני", "שקרניות", "שקרנים", "שקרנית", "שרלטן", "שרלטנים", 
    "שרלטנית", "שתחנק", "שתמות", "שתמותי", "שתסתמי", "שתשרפי", "תחמן", "תחמניות", "תחמנים", "תחמנית", 
    "תיסתום", "תישארמה", "תמותי", "תנענע", "תסתום", "תסתמו", "תסתמי", "תעופי", "תעפו", "תשרף", "תשתכשכי"]
pattern = re.compile(r'\b(?:' + '|'.join(map(re.escape, offensive_words)) + r')\b', re.IGNORECASE)

# Function to find offensive words using regex
def find_offensive_words_regex(conversation):
    found_words = pattern.findall(conversation)
    return list(set(found_words))

data = data[['committee_name', 'session_id', 'format', 'chairperson', '', 'speaker_name', 'conversation']]
data['conversation'] = data['conversation'].astype(str)
data['contain_offensive_words'] = data['conversation'].apply(
    lambda x: 1 if pattern.search(x) else 0)
data['offensive_words'] = data['conversation'].apply(
    lambda x: ', '.join(find_offensive_words_regex(x)))
print(data.head())
data.to_csv('updated_data_with_offensive_words.csv', index=False)
